# **Operadores**
* A biblioteca pandas permite utilizar operadores lógicos e aritméticos
 em colunas inteiras de um DataFrame

* Alguns exemplos de operadores:
    * +, +=
    * -, -=
    * *, *=
    * /, /=
    * ==, >=, <=, !=, >, <

In [28]:
import pandas as pd

In [29]:
df = pd.DataFrame({
    "Nome": ["Ana", "Bruno", "Carla", "Daniela", "Eduardo"],
    "Idade": [17, 19, 20, 18, 31],
    "Sexo": ["F", "M", "F", "F", "M"],
    "Cidade": ["São Paulo", "Rio de Janeiro", "Belo Horizonte", "Curitiba", "Porto Alegre"]
})
df

      Nome  Idade Sexo          Cidade
0      Ana     17    F       São Paulo
1    Bruno     19    M  Rio de Janeiro
2    Carla     20    F  Belo Horizonte
3  Daniela     18    F        Curitiba
4  Eduardo     31    M    Porto Alegre

## **Exemplo de como aumentar em 1 ano a idade de todas as pessoas do DataFrame**

In [31]:
df["Idade"]+= 1 # Aumentei a idade de todos os alunos em 1 ano
df

      Nome  Idade Sexo          Cidade
0      Ana     18    F       São Paulo
1    Bruno     20    M  Rio de Janeiro
2    Carla     21    F  Belo Horizonte
3  Daniela     19    F        Curitiba
4  Eduardo     32    M    Porto Alegre

* Como resultado da aplicação de um operador lógico uma lista de booleanos é obtida representando a resposta para cada linha do DataFrame.
* Exemplo de como verificar as pessoas que já atingiram a maioridade penal.

In [41]:
resultado = list(df["Idade"] >=  18)
resultado

[True, True, True, True, True]

In [42]:
# Agora eu quero localizar que sao
display(df.loc[resultado])
display(df[df["Idade"] >= 18]) # Outra forma de fazer a mesma coisa

      Nome  Idade Sexo          Cidade
0      Ana     18    F       São Paulo
1    Bruno     20    M  Rio de Janeiro
2    Carla     21    F  Belo Horizonte
3  Daniela     19    F        Curitiba
4  Eduardo     32    M    Porto Alegre

      Nome  Idade Sexo          Cidade
0      Ana     18    F       São Paulo
1    Bruno     20    M  Rio de Janeiro
2    Carla     21    F  Belo Horizonte
3  Daniela     19    F        Curitiba
4  Eduardo     32    M    Porto Alegre

* ## Exemplo de como verificar as pessoas do sexo feminino

In [43]:
pessoas_F = list(df.Sexo == "F")
pessoas_F

[True, False, True, True, False]

In [44]:
df[pessoas_F]

      Nome  Idade Sexo          Cidade
0      Ana     18    F       São Paulo
2    Carla     21    F  Belo Horizonte
3  Daniela     19    F        Curitiba